In [1]:
#import os    
#os.environ['SPARK_HOME'] = 'D:\\Pyspark\\spark-3.1.1-bin-hadoop3.2'

In [1]:
import findspark
findspark.find()

'D:\\Pyspark\\spark-3.1.1-bin-hadoop3.2'

In [2]:
findspark.init()

In [3]:
import pyspark

In [4]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('practise').getOrCreate()

In [5]:
spark

In [6]:
df = spark.read.option('header', True).csv('updated_demographic.csv', inferSchema=True)

In [7]:
df.show()

+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|participant_id|examination_status|gender|age_in_years|race_and_origin|race_and_origin_with_asian|six_months_gap|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|         73557|                 2|     1|          69|              4|                         4|             1|
|         73558|                 2|     1|          54|              3|                         3|             1|
|         73559|                 2|     1|          72|              3|                         3|             2|
|         73560|                 2|     1|           9|              3|                         3|             1|
|         73561|                 2|     2|          73|              3|                         3|             1|
|         73562|                 2|     1|          56|              1|                         1|             1|
|         73563|                 2|     1|           5|              3|                         3|             2|
|         73564|                 2|     2|          61|              3|                         3|             2|
|         73565|                 1|     1|          42|              2|                         2|             2|
|         73566|                 2|     2|          56|              3|                         3|             1|
|         73567|                 2|     1|          65|              3|                         3|             2|
|         73568|                 2|     2|          26|              3|                         3|             2|
|         73569|                 1|     2|           5|              5|                         7|             2|
|         73570|                 2|     2|           9|              5|                         7|             1|
|         73571|                 2|     1|          76|              3|                         3|             1|
|         73572|                 2|     2|          15|              4|                         4|             1|
|         73573|                 2|     1|          15|              4|                         4|             1|
|         73574|                 2|     2|          33|              5|                         6|             1|
|         73575|                 2|     1|           1|              4|                         4|             1|
|         73576|                 2|     1|          16|              4|                         4|             2|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
only showing top 20 rows

In [8]:
type(df)

pyspark.sql.dataframe.DataFrame

In [9]:
#check schema
df.printSchema()

root
 |-- participant_id: integer (nullable = true)
 |-- examination_status: integer (nullable = true)
 |-- gender: integer (nullable = true)
 |-- age_in_years: integer (nullable = true)
 |-- race_and_origin: integer (nullable = true)
 |-- race_and_origin_with_asian: integer (nullable = true)
 |-- six_months_gap: integer (nullable = true)

In [10]:
##Another option
df_spark = spark.read.csv('updated_demographic.csv', header=True, inferSchema=True)

In [11]:
df_spark.printSchema()

root
 |-- participant_id: integer (nullable = true)
 |-- examination_status: integer (nullable = true)
 |-- gender: integer (nullable = true)
 |-- age_in_years: integer (nullable = true)
 |-- race_and_origin: integer (nullable = true)
 |-- race_and_origin_with_asian: integer (nullable = true)
 |-- six_months_gap: integer (nullable = true)

In [12]:
df_spark.show()

+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|participant_id|examination_status|gender|age_in_years|race_and_origin|race_and_origin_with_asian|six_months_gap|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|         73557|                 2|     1|          69|              4|                         4|             1|
|         73558|                 2|     1|          54|              3|                         3|             1|
|         73559|                 2|     1|          72|              3|                         3|             2|
|         73560|                 2|     1|           9|              3|                         3|             1|
|         73561|                 2|     2|          73|              3|                         3|             1|
|         73562|                 2|     1|          56|              1|                         1|             1|
|         73563|                 2|     1|           5|              3|                         3|             2|
|         73564|                 2|     2|          61|              3|                         3|             2|
|         73565|                 1|     1|          42|              2|                         2|             2|
|         73566|                 2|     2|          56|              3|                         3|             1|
|         73567|                 2|     1|          65|              3|                         3|             2|
|         73568|                 2|     2|          26|              3|                         3|             2|
|         73569|                 1|     2|           5|              5|                         7|             2|
|         73570|                 2|     2|           9|              5|                         7|             1|
|         73571|                 2|     1|          76|              3|                         3|             1|
|         73572|                 2|     2|          15|              4|                         4|             1|
|         73573|                 2|     1|          15|              4|                         4|             1|
|         73574|                 2|     2|          33|              5|                         6|             1|
|         73575|                 2|     1|           1|              4|                         4|             1|
|         73576|                 2|     1|          16|              4|                         4|             2|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
only showing top 20 rows

In [13]:
df_spark.columns

['participant_id',
 'examination_status',
 'gender',
 'age_in_years',
 'race_and_origin',
 'race_and_origin_with_asian',
 'six_months_gap']

In [14]:
df_spark.head()

Row(participant_id=73557, examination_status=2, gender=1, age_in_years=69, race_and_origin=4, race_and_origin_with_asian=4, six_months_gap=1)

In [15]:
#selecting a column
df_spark.select('participant_id').show(10)

+--------------+
|participant_id|
+--------------+
|         73557|
|         73558|
|         73559|
|         73560|
|         73561|
|         73562|
|         73563|
|         73564|
|         73565|
|         73566|
+--------------+
only showing top 10 rows

In [16]:
df_spark.select(['participant_id', 'gender']).show()

+--------------+------+
|participant_id|gender|
+--------------+------+
|         73557|     1|
|         73558|     1|
|         73559|     1|
|         73560|     1|
|         73561|     2|
|         73562|     1|
|         73563|     1|
|         73564|     2|
|         73565|     1|
|         73566|     2|
|         73567|     1|
|         73568|     2|
|         73569|     2|
|         73570|     2|
|         73571|     1|
|         73572|     2|
|         73573|     1|
|         73574|     2|
|         73575|     1|
|         73576|     1|
+--------------+------+
only showing top 20 rows

In [17]:
df_spark.dtypes

[('participant_id', 'int'),
 ('examination_status', 'int'),
 ('gender', 'int'),
 ('age_in_years', 'int'),
 ('race_and_origin', 'int'),
 ('race_and_origin_with_asian', 'int'),
 ('six_months_gap', 'int')]

In [18]:
df_spark.describe().toPandas() #toPandas() gives better visualization than show()

,summary,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap
0,count,10175,10175,10175,10175,10175,10175,10175
1,mean,78644.0,1.9644226044226045,1.5083046683046684,32.274299754299754,3.091891891891892,3.28982800982801,1.525995085995086
2,stddev,2937.4138285233153,0.1852431293855907,0.49995559617340146,24.630410253136994,1.2633047033277733,1.613240660729097,0.49934833686004887
3,min,73557,1,1,1,1,1,1
4,max,83731,2,2,85,5,7,2

In [19]:
#Adding columns
df_spark.withColumn('Age in months', df_spark['age_in_years'] * 12).toPandas() #not inplace

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap,Age in months
0,73557,2,1,69,4,4,1,828
1,73558,2,1,54,3,3,1,648
2,73559,2,1,72,3,3,2,864
3,73560,2,1,9,3,3,1,108
4,73561,2,2,73,3,3,1,876
...,...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2,312
10171,83728,2,2,2,1,1,2,24
10172,83729,2,2,42,4,4,2,504
10173,83730,2,1,7,2,2,1,84
10174,83731,2,1,11,5,6,1,132

In [20]:
# Adding the column inplace
df_spark = df_spark.withColumn("age_in_months", df_spark['age_in_years']*12)

In [21]:
df_spark.toPandas()

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap,age_in_months
0,73557,2,1,69,4,4,1,828
1,73558,2,1,54,3,3,1,648
2,73559,2,1,72,3,3,2,864
3,73560,2,1,9,3,3,1,108
4,73561,2,2,73,3,3,1,876
...,...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2,312
10171,83728,2,2,2,1,1,2,24
10172,83729,2,2,42,4,4,2,504
10173,83730,2,1,7,2,2,1,84
10174,83731,2,1,11,5,6,1,132

In [22]:
#Dropping the columns
df_spark = df_spark.drop('age_in_months')

In [23]:
df_spark.toPandas()

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap
0,73557,2,1,69,4,4,1
1,73558,2,1,54,3,3,1
2,73559,2,1,72,3,3,2
3,73560,2,1,9,3,3,1
4,73561,2,2,73,3,3,1
...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2
10171,83728,2,2,2,1,1,2
10172,83729,2,2,42,4,4,2
10173,83730,2,1,7,2,2,1
10174,83731,2,1,11,5,6,1

In [24]:
#Rename the column

df_spark = df_spark.withColumnRenamed('age_in_years', 'age')

In [25]:
df_spark.toPandas()

,participant_id,examination_status,gender,age,race_and_origin,race_and_origin_with_asian,six_months_gap
0,73557,2,1,69,4,4,1
1,73558,2,1,54,3,3,1
2,73559,2,1,72,3,3,2
3,73560,2,1,9,3,3,1
4,73561,2,2,73,3,3,1
...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2
10171,83728,2,2,2,1,1,2
10172,83729,2,2,42,4,4,2
10173,83730,2,1,7,2,2,1
10174,83731,2,1,11,5,6,1

## Handle null values

In [26]:
spark_df = spark.read.csv('random_csv.csv', header=True, inferSchema=True)

In [27]:
spark_df.show()

+-------------+----+------+
|         Name| Age|Salary|
+-------------+----+------+
|Prakash Dahal|  21|  null|
|          SPR|null| 35000|
|          SCF|  22| 30000|
|          ABC|  25|  null|
|          PQR|null|  null|
|          XYZ|  24|  null|
|         null|  25| 37000|
+-------------+----+------+

In [28]:
spark_df.toPandas()

            Name   Age   Salary
0  Prakash Dahal  21.0      NaN
1            SPR   NaN  35000.0
2            SCF  22.0  30000.0
3            ABC  25.0      NaN
4            PQR   NaN      NaN
5            XYZ  24.0      NaN
6           None  25.0  37000.0

In [29]:
#Counting rows
spark_df.count()

7

In [30]:
spark_df.corr('Age', 'Salary')

-0.09484454838593365

In [31]:
spark_df.distinct().count()

7

In [32]:
spark_df.fillna({"Age":20}).show()

+-------------+---+------+
|         Name|Age|Salary|
+-------------+---+------+
|Prakash Dahal| 21|  null|
|          SPR| 20| 35000|
|          SCF| 22| 30000|
|          ABC| 25|  null|
|          PQR| 20|  null|
|          XYZ| 24|  null|
|         null| 25| 37000|
+-------------+---+------+

In [33]:
spark_df.fillna({"Age":20, "Name":"Unknown", "Salary":20000}).show()

+-------------+---+------+
|         Name|Age|Salary|
+-------------+---+------+
|Prakash Dahal| 21| 20000|
|          SPR| 20| 35000|
|          SCF| 22| 30000|
|          ABC| 25| 20000|
|          PQR| 20| 20000|
|          XYZ| 24| 20000|
|      Unknown| 25| 37000|
+-------------+---+------+

In [34]:
from pyspark.sql.functions import avg, count, col

In [35]:
#Selecting average of a column 
spark_df.select(avg("Age").alias('Average Age')).show()

+-----------+
|Average Age|
+-----------+
|       23.4|
+-----------+

In [37]:
spark_df.select(avg(col('Age')).alias("Average age")).show()

+-----------+
|Average age|
+-----------+
|       23.4|
+-----------+

In [38]:
spark_df.dropna().show()

+----+---+------+
|Name|Age|Salary|
+----+---+------+
| SCF| 22| 30000|
+----+---+------+

In [39]:
from pyspark.ml.feature import Imputer

In [44]:
#Filling with mean values
imputer = Imputer(strategy='mean', inputCols=['Age', 'Salary'], outputCols=['Imputed_Age', 'Imputed_Salary'])

In [45]:
imputer.fit(spark_df).transform(spark_df).show()

+-------------+----+------+-----------+--------------+
|         Name| Age|Salary|Imputed_Age|Imputed_Salary|
+-------------+----+------+-----------+--------------+
|Prakash Dahal|  21|  null|         21|         34000|
|          SPR|null| 35000|         23|         35000|
|          SCF|  22| 30000|         22|         30000|
|          ABC|  25|  null|         25|         34000|
|          PQR|null|  null|         23|         34000|
|          XYZ|  24|  null|         24|         34000|
|         null|  25| 37000|         25|         37000|
+-------------+----+------+-----------+--------------+

In [46]:
#All the above functions are not done inplace
spark_df.show()

+-------------+----+------+
|         Name| Age|Salary|
+-------------+----+------+
|Prakash Dahal|  21|  null|
|          SPR|null| 35000|
|          SCF|  22| 30000|
|          ABC|  25|  null|
|          PQR|null|  null|
|          XYZ|  24|  null|
|         null|  25| 37000|
+-------------+----+------+

In [65]:
from pyspark.sql.functions import when, isnan, count, col, isnull
import numpy as np

In [60]:
spark_df.withColumn('Salary', \
                   when(spark_df['Name']=="Prakash Dahal", 35000)\
                   .when(spark_df['Name'] == np.nan, 20000).otherwise(spark_df['Salary'])).show()

+-------------+----+------+
|         Name| Age|Salary|
+-------------+----+------+
|Prakash Dahal|  21| 35000|
|          SPR|null| 35000|
|          SCF|  22| 30000|
|          ABC|  25|  null|
|          PQR|null|  null|
|          XYZ|  24|  null|
|         null|  25| 37000|
+-------------+----+------+

In [67]:
spark_df.show()

+-------------+----+------+
|         Name| Age|Salary|
+-------------+----+------+
|Prakash Dahal|  21|  null|
|          SPR|null| 35000|
|          SCF|  22| 30000|
|          ABC|  25|  null|
|          PQR|null|  null|
|          XYZ|  24|  null|
|         null|  25| 37000|
+-------------+----+------+

In [106]:
spark_df.select([when(isnull(c),c).alias(c) for c in spark_df.columns]).show()

+----+----+------+
|Name| Age|Salary|
+----+----+------+
|null|null|Salary|
|null| Age|  null|
|null|null|  null|
|null|null|Salary|
|null| Age|Salary|
|null|null|Salary|
|Name|null|  null|
+----+----+------+

In [71]:
#Counting the null values in all columns
spark_df.select([count(when(isnull(c),c)).alias(c) for c in spark_df.columns]).show()

+----+---+------+
|Name|Age|Salary|
+----+---+------+
|   1|  2|     4|
+----+---+------+

In [83]:
spark_df.dtypes

[('Name', 'string'), ('Age', 'int'), ('Salary', 'int')]

In [99]:
dict(spark_df.dtypes)['Name']

'string'

In [101]:
#Replace null values based on columns dtypes
spark_df.select([when(isnull(c), "Unknown").otherwise(spark_df[c]).alias(c)  for c in spark_df.columns]).show()

+-------------+-------+-------+
|         Name|    Age| Salary|
+-------------+-------+-------+
|Prakash Dahal|     21|Unknown|
|          SPR|Unknown|  35000|
|          SCF|     22|  30000|
|          ABC|     25|Unknown|
|          PQR|Unknown|Unknown|
|          XYZ|     24|Unknown|
|      Unknown|     25|  37000|
+-------------+-------+-------+

In [105]:
#Filter command
spark_df.filter(spark_df['Salary']>30000).show()

+----+----+------+
|Name| Age|Salary|
+----+----+------+
| SPR|null| 35000|
|null|  25| 37000|
+----+----+------+

In [111]:
#And operations

spark_df.filter((spark_df['Salary']>30000) & (spark_df['Age']>22)).show()

+----+---+------+
|Name|Age|Salary|
+----+---+------+
|null| 25| 37000|
+----+---+------+

In [116]:
#Row 0, column 0 value
spark_df.collect()[0][0]

'Prakash Dahal'

In [117]:
#Row 0, column 1 value
spark_df.collect()[0][1]

21

## GroupBy and Aggregate functions

In [118]:
spark_df.groupBy("Name").sum().show()

+-------------+--------+-----------+
|         Name|sum(Age)|sum(Salary)|
+-------------+--------+-----------+
|Prakash Dahal|      21|       null|
|         null|      25|      37000|
|          SPR|    null|      35000|
|          PQR|    null|       null|
|          XYZ|      24|       null|
|          ABC|      25|       null|
|          SCF|      22|      30000|
+-------------+--------+-----------+

In [122]:
spark_df.agg({"Age":"max"}).show()

+--------+
|max(Age)|
+--------+
|      25|
+--------+

-----

## MLib

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName("Mlib").getOrCreate()

In [3]:
spark

In [4]:
df = spark.read.csv('Salary_Data.csv', header=True, inferSchema=True)

In [5]:
df.show()

+---------------+-------+
|YearsExperience| Salary|
+---------------+-------+
|            1.1|39343.0|
|            1.3|46205.0|
|            1.5|37731.0|
|            2.0|43525.0|
|            2.2|39891.0|
|            2.9|56642.0|
|            3.0|60150.0|
|            3.2|54445.0|
|            3.2|64445.0|
|            3.7|57189.0|
|            3.9|63218.0|
|            4.0|55794.0|
|            4.0|56957.0|
|            4.1|57081.0|
|            4.5|61111.0|
|            4.9|67938.0|
|            5.1|66029.0|
|            5.3|83088.0|
|            5.9|81363.0|
|            6.0|93940.0|
+---------------+-------+
only showing top 20 rows

In [6]:
df.printSchema()

root
 |-- YearsExperience: double (nullable = true)
 |-- Salary: double (nullable = true)

In [8]:
df.describe().show()

+-------+------------------+------------------+
|summary|   YearsExperience|            Salary|
+-------+------------------+------------------+
|  count|                30|                30|
|   mean|5.3133333333333335|           76003.0|
| stddev| 2.837888157662718|27414.429784582302|
|    min|               1.1|           37731.0|
|    max|              10.5|          122391.0|
+-------+------------------+------------------+

In [9]:
df.count()

30

In [11]:
#max salary of person having less than 2 yrs experience

df.filter(df['YearsExperience'] <2).agg({"Salary":'max'}).show()

+-----------+
|max(Salary)|
+-----------+
|    46205.0|
+-----------+

In [12]:
df.columns

['YearsExperience', 'Salary']

In [13]:
from pyspark.ml.feature import VectorAssembler
from pyspark.ml.regression import LinearRegression

In [15]:
"""
  Every independent features should be transformed using VectorAssembler before training in Pyspark
  
"""

va = VectorAssembler(inputCols=['YearsExperience'], outputCol='Features')

In [17]:
df = va.transform(df)

In [18]:
df.show(5)

+---------------+-------+--------+
|YearsExperience| Salary|Features|
+---------------+-------+--------+
|            1.1|39343.0|   [1.1]|
|            1.3|46205.0|   [1.3]|
|            1.5|37731.0|   [1.5]|
|            2.0|43525.0|   [2.0]|
|            2.2|39891.0|   [2.2]|
+---------------+-------+--------+
only showing top 5 rows

In [19]:
final_df = df.select(['Features', 'Salary'])

In [21]:
final_df.show(5)

+--------+-------+
|Features| Salary|
+--------+-------+
|   [1.1]|39343.0|
|   [1.3]|46205.0|
|   [1.5]|37731.0|
|   [2.0]|43525.0|
|   [2.2]|39891.0|
+--------+-------+
only showing top 5 rows

In [22]:
train, test = final_df.randomSplit([0.75, 0.25])

In [24]:
train.show(5)

+--------+-------+
|Features| Salary|
+--------+-------+
|   [1.1]|39343.0|
|   [1.3]|46205.0|
|   [1.5]|37731.0|
|   [2.2]|39891.0|
|   [2.9]|56642.0|
+--------+-------+
only showing top 5 rows

In [25]:
test.show(5)

+--------+-------+
|Features| Salary|
+--------+-------+
|   [2.0]|43525.0|
|   [3.0]|60150.0|
|   [4.9]|67938.0|
|   [5.3]|83088.0|
|   [5.9]|81363.0|
+--------+-------+
only showing top 5 rows

In [26]:
lr = LinearRegression(featuresCol='Features',
    labelCol='Salary')

In [29]:
lr = lr.fit(train)

In [30]:
lr.coefficients

DenseVector([9450.1769])

In [31]:
lr.numFeatures

1

In [32]:
predictions = lr.evaluate(test)

In [33]:
#Showing the predictions dataframe
predictions.predictions.show()

+--------+--------+------------------+
|Features|  Salary|        prediction|
+--------+--------+------------------+
|   [2.0]| 43525.0|44221.980685605864|
|   [3.0]| 60150.0| 53672.15758338304|
|   [4.9]| 67938.0| 71627.49368915969|
|   [5.3]| 83088.0| 75407.56444827055|
|   [5.9]| 81363.0| 81077.67058693686|
|   [6.8]| 91738.0| 89582.82979493632|
|   [9.5]|116969.0| 115098.3074189347|
+--------+--------+------------------+

In [35]:
#r2
predictions.r2

0.9632309083159991

------

### Linear Regression using PySpark

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName("linear_regression").getOrCreate()

In [3]:
tips_df = spark.read.csv('tips.csv', header=True, inferSchema=True)

In [4]:
tips_df.show(5)

+----------+----+------+------+---+------+----+
|total_bill| tip|   sex|smoker|day|  time|size|
+----------+----+------+------+---+------+----+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|
+----------+----+------+------+---+------+----+
only showing top 5 rows

In [5]:
tips_df.printSchema()

root
 |-- total_bill: double (nullable = true)
 |-- tip: double (nullable = true)
 |-- sex: string (nullable = true)
 |-- smoker: string (nullable = true)
 |-- day: string (nullable = true)
 |-- time: string (nullable = true)
 |-- size: integer (nullable = true)

In [7]:
tips_df.describe().toPandas()

,summary,total_bill,tip,sex,smoker,day,time,size
0,count,244,244,244,244,244,244,244
1,mean,19.785942622950824,2.9982786885245902,None,None,None,None,2.569672131147541
2,stddev,8.902411954856857,1.3836381890011815,None,None,None,None,0.9510998047322347
3,min,3.07,1.0,Female,No,Fri,Dinner,1
4,max,50.81,10.0,Male,Yes,Thur,Lunch,6

In [8]:
tips_df.columns

['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size']

In [9]:
#count rows
tips_df.count()

244

In [10]:
#Handling categorical features (Ordinal encoding)

from pyspark.ml.feature import StringIndexer

In [13]:
encoder = StringIndexer(inputCols=['sex', 'smoker', 'day', 'time'],
                   outputCols=['sex_encoded', 'smoker_encoded', 'day_encoded', 'time_encoded'])

In [14]:
encoder.fit(tips_df).transform(tips_df).show(5)

+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+
|total_bill| tip|   sex|smoker|day|  time|size|sex_encoded|smoker_encoded|day_encoded|time_encoded|
+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|        1.0|           0.0|        1.0|         0.0|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|         0.0|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|         0.0|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|         0.0|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|        1.0|           0.0|        1.0|         0.0|
+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+
only showing top 5 rows

In [25]:
updated_tips_df = encoder.fit(tips_df).transform(tips_df)

In [26]:
updated_tips_df.show(5)

+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+
|total_bill| tip|   sex|smoker|day|  time|size|sex_encoded|smoker_encoded|day_encoded|time_encoded|
+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|        1.0|           0.0|        1.0|         0.0|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|         0.0|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|         0.0|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|         0.0|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|        1.0|           0.0|        1.0|         0.0|
+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+
only showing top 5 rows

In [27]:
#Creating VectorAssembler to store independent features

from pyspark.ml.feature import VectorAssembler

In [28]:
va = VectorAssembler(inputCols=['tip','sex_encoded', 'smoker_encoded', 'day_encoded', 'time_encoded', 'size'], 
                     outputCol='Independent Features')

In [29]:
updated_tips_df = va.transform(updated_tips_df)

In [30]:
updated_tips_df.show(5)

+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+--------------------+
|total_bill| tip|   sex|smoker|day|  time|size|sex_encoded|smoker_encoded|day_encoded|time_encoded|Independent Features|
+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+--------------------+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|        1.0|           0.0|        1.0|         0.0|[1.01,1.0,0.0,1.0...|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|         0.0|[1.66,0.0,0.0,1.0...|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|         0.0|[3.5,0.0,0.0,1.0,...|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|         0.0|[3.31,0.0,0.0,1.0...|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|        1.0|           0.0|        1.0|         0.0|[3.61,1.0,0.0,1.0...|
+----------+----+------+------+---+------+----+-----------+--------------+-----------+------------+--------------------+
only showing top 5 rows

In [31]:
updated_tips_df.select('Independent Features').show(5)

+--------------------+
|Independent Features|
+--------------------+
|[1.01,1.0,0.0,1.0...|
|[1.66,0.0,0.0,1.0...|
|[3.5,0.0,0.0,1.0,...|
|[3.31,0.0,0.0,1.0...|
|[3.61,1.0,0.0,1.0...|
+--------------------+
only showing top 5 rows

In [32]:
final_df = updated_tips_df.select(['Independent Features', 'total_bill'])

In [33]:
final_df.show(5)

+--------------------+----------+
|Independent Features|total_bill|
+--------------------+----------+
|[1.01,1.0,0.0,1.0...|     16.99|
|[1.66,0.0,0.0,1.0...|     10.34|
|[3.5,0.0,0.0,1.0,...|     21.01|
|[3.31,0.0,0.0,1.0...|     23.68|
|[3.61,1.0,0.0,1.0...|     24.59|
+--------------------+----------+
only showing top 5 rows

In [34]:
from pyspark.ml.regression import LinearRegression

In [35]:
lr = LinearRegression(featuresCol='Independent Features', labelCol='total_bill')

In [36]:
train, test = final_df.randomSplit([0.75, 0.25])

In [38]:
train.show(5)

+--------------------+----------+
|Independent Features|total_bill|
+--------------------+----------+
|(6,[0,5],[1.25,2.0])|     10.07|
|(6,[0,5],[1.25,2.0])|     10.51|
|(6,[0,5],[1.45,2.0])|      9.55|
|(6,[0,5],[1.47,2.0])|     10.77|
| (6,[0,5],[2.0,2.0])|     13.37|
+--------------------+----------+
only showing top 5 rows

In [39]:
test.show(5)

+--------------------+----------+
|Independent Features|total_bill|
+--------------------+----------+
|(6,[0,5],[1.75,2.0])|     17.82|
|(6,[0,5],[1.97,2.0])|     12.02|
| (6,[0,5],[2.0,2.0])|     12.69|
|(6,[0,5],[2.01,2.0])|     20.23|
|(6,[0,5],[2.31,3.0])|     18.69|
+--------------------+----------+
only showing top 5 rows

In [40]:
#Training the model
lr = lr.fit(train)

In [41]:
lr.coefficients

DenseVector([3.0211, 0.1488, 2.836, -0.4283, -1.3993, 3.9509])

In [42]:
#Evaluating in test set
pred = lr.evaluate(test)

In [44]:
#Showing predictions
pred.predictions.show(5)

+--------------------+----------+------------------+
|Independent Features|total_bill|        prediction|
+--------------------+----------+------------------+
|(6,[0,5],[1.75,2.0])|     17.82|13.701049833068856|
|(6,[0,5],[1.97,2.0])|     12.02| 14.36568796522966|
| (6,[0,5],[2.0,2.0])|     12.69|14.456320437797043|
|(6,[0,5],[2.01,2.0])|     20.23| 14.48653126198617|
|(6,[0,5],[2.31,3.0])|     18.69|  19.3438042872655|
+--------------------+----------+------------------+
only showing top 5 rows

In [45]:
pred.meanAbsoluteError

4.677935636707695

In [46]:
pred.r2

0.4589494891039666

In [47]:
pred.rootMeanSquaredError

6.204858466870038

## Random solution
- To check the values of Column1 and Column2 matches with values of Column4 and Column5
- If matches add True else add False in new column `Exist`

In [9]:
df = spark.read.csv('demo.csv', header=True, inferSchema=True)

In [10]:
df.show()

+-------+-------+-------+-------+-------+-------+
|Column1|Column2|Column3|Column4|Column5|Column6|
+-------+-------+-------+-------+-------+-------+
|      0|      0|      2|   null|   null|   null|
|      2|      2|      1|   null|   null|   null|
|      1|      3|      1|   null|   null|   null|
|   null|   null|   null|      1|      2|      2|
|   null|   null|   null|      0|      0|      2|
|   null|   null|   null|      1|      2|      2|
+-------+-------+-------+-------+-------+-------+

In [25]:
col1_col2 = []
col4_col5 = []
for ele in df.collect():
    col1_col2.append([ele[0], ele[1]])
    col4_col5.append([ele[3], ele[4]])

In [26]:
col1_col2

[['0', '0'],
 ['2', '2'],
 ['1', '3'],
 ['null', 'null'],
 ['null', 'null'],
 ['null', 'null']]

In [27]:
col4_col5

[['null', 'null'],
 ['null', 'null'],
 ['null', 'null'],
 ['1', '2'],
 ['0', '0'],
 ['1', '2']]

In [28]:
col_exist = []
for ele in col1_col2:
    if ele in col4_col5:
        col_exist.append("TRUE")
    else:
        col_exist.append("FALSE")

In [29]:
col_exist

['TRUE', 'FALSE', 'FALSE', 'TRUE', 'TRUE', 'TRUE']

In [43]:
import pandas as pd
pd_exist = pd.DataFrame(col_exist, columns=['Exist'])

In [44]:
pd_exist

   Exist
0   TRUE
1  FALSE
2  FALSE
3   TRUE
4   TRUE
5   TRUE

In [48]:
spark_df = pd.read_csv("demo.csv")

In [50]:
spark_df['Exist'] = col_exist

In [51]:
final_df = spark.createDataFrame(spark_df)

In [53]:
final_df.show()

+-------+-------+-------+-------+-------+-------+-----+
|Column1|Column2|Column3|Column4|Column5|Column6|Exist|
+-------+-------+-------+-------+-------+-------+-----+
|    0.0|    0.0|    2.0|    NaN|    NaN|    NaN| TRUE|
|    2.0|    2.0|    1.0|    NaN|    NaN|    NaN|FALSE|
|    1.0|    3.0|    1.0|    NaN|    NaN|    NaN|FALSE|
|    NaN|    NaN|    NaN|    1.0|    2.0|    2.0| TRUE|
|    NaN|    NaN|    NaN|    0.0|    0.0|    2.0| TRUE|
|    NaN|    NaN|    NaN|    1.0|    2.0|    2.0| TRUE|
+-------+-------+-------+-------+-------+-------+-----+